local _, ns = ...
ns.actions = {
    rebuffs = {
        kings = { "Великое благословение королей", "Благословение королей" },
        might = { "Великое благословение могущества", "Благословение могущества" },
        wisdom = { "Великое благословение мудрости", "Благословение мудрости" },
        sanctuary = { "Великое благословение неприкосновенности", "Благословение неприкосновенности" },
        fort = { "Молитва стойкости", "Слово силы: Стойкость" },
        spirit = { "Молитва духа", "Божественный дух" },
        shadow = { "Молитва защиты от темной магии", "Защита от темной магии" },
        int = { "Чародейская гениальность", "Чародейский интеллект", "Чародейская гениальность Даларана",
                "Чародейский интеллект Даларана" },
        motw = { "Дар дикой природы", "Знак дикой природы" },
    },
    kicks = { "Пинок", "Удар щитом", "Зуботычина", "Пронизывающий ветер", "Заморозка разума", "Антимагия",
              "Запрет чар" },
    selfRez = { "Перерождение" },
    stone = "Воскрешение камнем души",
    stoneId = 47883,
    badges = {
        { kind = "rebuff", id = 25898, tip = "sum.b.rebuff" },
        { kind = "rebuffed", id = 48477, tip = "sum.b.rebuffed" },
        { kind = "cc", boss = "Леди Смертный Шепот", spells = { "Смерч", "Превращение" }, id = 33786,
          tip = "sum.b.cc" },
        { kind = "wrath", boss = "Король-лич", spells = { "Гнев небес" }, id = 48817, tip = "sum.b.wrath" },
    },
}
