local _, ns = ...
ns.bosses = {
    ["Лорд Ребрад"] = "Лорд Ребрад",
    ["Леди Смертный Шепот"] = "Леди Смертный Шепот",
    ["Саурфанг Смертоносный"] = "Саурфанг Смертоносный",
    ["Тухлопуз"] = "Тухлопуз",
    ["Гниломорд"] = "Гниломорд",
    ["Профессор Мерзоцид"] = "Профессор Мерзоцид",
    ["Принц Валанар"] = "Совет кровавых принцев",
    ["Принц Талдарам"] = "Совет кровавых принцев",
    ["Принц Келесет"] = "Совет кровавых принцев",
    ["Кровавая королева Лана'тель"] = "Кровавая королева Лана'тель",
    ["Валитрия Сноходица"] = "Валитрия Сноходица",
    ["Синдрагоса"] = "Синдрагоса",
    ["Король-лич"] = "Король-лич",
    ["Верховный правитель Саурфанг"] = "Бой на кораблях",
    ["Мурадин Бронзобород"] = "Бой на кораблях",
    ["Огненный Левиафан"] = "Огненный Левиафан",
    ["Повелитель Горнов Игнис"] = "Повелитель Горнов Игнис",
    ["Острокрылая"] = "Острокрылая",
    ["Разрушитель XT-002"] = "Разрушитель XT-002",
    ["Сердце Разрушителя"] = "Разрушитель XT-002",
    ["Сталелом"] = "Железное собрание",
    ["Мастер рун Молгейм"] = "Железное собрание",
    ["Буревестник Брундир"] = "Железное собрание",
    ["Кологарн"] = "Кологарн",
    ["Левая рука"] = "Кологарн",
    ["Правая рука"] = "Кологарн",
    ["Ауриайя"] = "Ауриайя",
    ["Часовой святилища"] = "Ауриайя",
    ["Дикий защитник"] = "Ауриайя",
    ["Ходир"] = "Ходир",
    ["Торим"] = "Торим",
    ["Фрейя"] = "Фрейя",
    ["Мимирон"] = "Мимирон",
    ["Левиафан II"] = "Мимирон",
    ["VX-001"] = "Мимирон",
    ["Воздушное судно"] = "Мимирон",
    ["Генерал Везакс"] = "Генерал Везакс",
    ["Саронитовый враг"] = "Генерал Везакс",
    ["Йогг-Сарон"] = "Йогг-Сарон",
    ["Сара"] = "Йогг-Сарон",
    ["Мозг Йогг-Сарона"] = "Йогг-Сарон",
    ["Страж Йогг-Сарона"] = "Йогг-Сарон",
    ["Алгалон Наблюдатель"] = "Алгалон Наблюдатель",
}
ns.bossParts = {
    ["Сердце Разрушителя"] = true,
    ["Левая рука"] = true,
    ["Правая рука"] = true,
    ["Часовой святилища"] = true,
    ["Дикий защитник"] = true,
    ["Левиафан II"] = true,
    ["Саронитовый враг"] = true,
    ["Сара"] = true,
    ["Мозг Йогг-Сарона"] = true,
    ["Страж Йогг-Сарона"] = true,
}
ns.bossWin = {
    ["Валитрия Сноходица"] = "Погружение в сон",
}
ns.bossYield = {
    ["Ходир"] = true,
    ["Торим"] = true,
    ["Фрейя"] = true,
    ["Алгалон Наблюдатель"] = true,
}
ns.scriptedKills = {
    ["Король-лич"] = { [72350] = "Неистовство Ледяной Скорби" },
}
ns.bossLast = {}
ns.bossSurvive = {
    ["Бой на кораблях"] = true,
}
ns.bossVehicle = {
    ["Бой на кораблях"] = true,
    ["Король-лич"] = true,
    ["Огненный Левиафан"] = true,
}
ns.vehicles = {
    ["Корабельное орудие Альянса"] = "Бой на кораблях",
    ["Корабельное орудие Орды"] = "Бой на кораблях",
}
ns.fullRegistry = {
    ["Цитадель Ледяной Короны"] = true,
    ["Ульдуар"] = true,
}
ns.fixates = {
    ["Мстительный дух"] = "Цель мстительного духа",
}
