local _, ns = ...
ns.phases = {
    ["Лорд Ребрад"] = {
        { spell = "Вихрь костей", label = "Вихрь костей", every = true },
    },
    ["Саурфанг Смертоносный"] = {
        { spell = "Бешенство", label = "Бешенство" },
    },
    ["Тухлопуз"] = {
        { spell = "Вдыхание гнилостных испарений", label = "Вдох", every = true },
    },
    ["Кровавая королева Лана'тель"] = {
        { spell = "Кровавый вихрь", label = "Кровавый вихрь", every = true },
    },
    ["Валитрия Сноходица"] = {
        { spell = "Ярость сновидицы", label = "Ярость сновидицы", every = true },
    },
    ["Синдрагоса"] = {
        { spell = "Ледяной склеп", label = "Ледяной склеп", every = true },
    },
    ["Король-лич"] = {
        { spell = "Беспощадность зимы", label = "Переход" },
        { spell = "Вызов валь'киры", label = "Фаза 2" },
        { spell = "Призыв зловещих духов", label = "Фаза 3" },
        { spell = "Неистовство Ледяной Скорби", label = "Развязка" },
    },
}
