local _, ns = ...
ns.consumeCatItem = {
    flask = 46377,
    potion = 40211,
}
ns.consumeCast = {
    [53755] = { cat = "flask", item = "Настой ледяного змея", id = 46376 },
    [53760] = { cat = "flask", item = "Настой бесконечной ярости", id = 46377 },
    [53758] = { cat = "flask", item = "Настой каменной крови", id = 46379 },
    [54212] = { cat = "flask", item = "Настой чистого колдунства", id = 46378 },
    [53752] = { cat = "flask", item = "Слабый настой крепости", id = 40079 },
    [67016] = { cat = "flask", item = "Настой севера", id = 47499, free = true },
    [67017] = { cat = "flask", item = "Настой севера", id = 47499, free = true },
    [67018] = { cat = "flask", item = "Настой севера", id = 47499, free = true },
    [53748] = { cat = "elixir", item = "Эликсир чрезвычайной силы", id = 40073 },
    [53749] = { cat = "elixir", item = "Эликсир гуру", id = 40076 },
    [53751] = { cat = "elixir", item = "Мощный эликсир стойкости", id = 40078 },
    [60346] = { cat = "elixir", item = "Эликсир скорости молнии", id = 44331 },
    [60347] = { cat = "elixir", item = "Эликсир могучего разума", id = 44332 },
    [53908] = { cat = "potion", item = "Зелье быстроты", id = 40211 },
    [53909] = { cat = "potion", item = "Зелье дикой магии", id = 40212 },
    [53762] = { cat = "potion", item = "Зелье несокрушимости", id = 40093 },
    [53753] = { cat = "potion", item = "Зелье кошмаров", id = 40081 },
    [43186] = { cat = "potion", item = "Рунический флакон с зельем маны", id = 33448 },
    [43185] = { cat = "potion", item = "Рунический флакон с лечебным зельем", id = 33447 },
    [67490] = { cat = "potion", item = "Рунический набор для инъекций маны", id = 42545 },
    [67489] = { cat = "potion", item = "Рунический набор для инъекций лечения", id = 41166 },
    [28499] = { cat = "potion", item = "Сверхмощное зелье маны", id = 22832 },
    [28508] = { cat = "potion", item = "Зелье разрушения", id = 22839 },
}
ns.consumeCreate = {
    [57426] = { cat = "food", item = "Рыбный пир", id = 43015 },
    [57301] = { cat = "food", item = "Великий пир", id = 34753 },
}
ns.consumeEnchant = {}
ns.raidFinal = {
    ["Цитадель Ледяной Короны"] = "Король-лич",
    ["Ульдуар"] = { "Йогг-Сарон", "Алгалон Наблюдатель" },
    ["Рубиновое святилище"] = "Халион",
    ["Испытание крестоносца"] = "Ануб'арак",
    ["Испытание великого крестоносца"] = "Ануб'арак",
    ["Наксрамас"] = "Кел'Тузад",
    ["Око Вечности"] = "Малигос",
    ["Логово Ониксии"] = "Ониксия",
    ["Обсидиановое святилище"] = "Сартарион",
}
ns.raidEncounters = {
    ["Цитадель Ледяной Короны"] = 12,
    ["Рубиновое святилище"] = 1,
    ["Испытание крестоносца"] = 5,
    ["Испытание великого крестоносца"] = 5,
    ["Ульдуар"] = 14,
    ["Наксрамас"] = 15,
    ["Око Вечности"] = 1,
    ["Логово Ониксии"] = 1,
    ["Обсидиановое святилище"] = 1,
}
ns.raidCut = {
    ["Король-лич"] = true,
}
